# в некоторых значениях числовых переменных добавлен пробел между цифрами. 
# В результате R определит такие переменные как строку (или как фактор по умолчанию). 
# Ваша задача написать функцию fix_data, которая получает на вход набор данных, 
# у которого в некоторых значениях числовых переменных добавлен пробел между
# цифрами. Ваша задача - избавиться от этого пробела и вернуть 
# числовым переменным их числовой тип. 
# Функция должна возвращать преобразованный набор данных,
# в котором все числовые переменные будут переведены в числовой тип, при этом 
# те переменные, которые действительно являются строковыми (например, V2 и V4)
# никак преобразовывать не надо!

df_add <- as_tibble(read.csv('add_task1.csv'))
str(df_add)
fix_data <- function(d){
  try.num <- function(x){
    xsd <- gsub(' ', '', x)
    if(any(is.na(xn <- suppressWarnings(as.numeric(xsd)))))
      return(x)
    return(xn)
  }
  res_add <- as.data.frame(lapply(d, function(x) try.num(x)))
  return(res_add)
}
fix_data(df_add)
